{"basics":{"name":"Kevin P.L Tan","label":"Operations & Digital Transformation Manager","image":null,"bg_image":null,"email":"kevinktg@outlook.com","phone":"+61498 765 0619","url":null,"location":{"address":null,"postal_code":null,"city":"Perth","country_code":"AU","region":null},"profiles":[{"network":"LinkedIn","username":"kevin-pl-tan","url":"https:\/\/www.linkedin.com\/in\/kevin-pl-tan","icon":null},{"network":"X","username":"kevinktg88","url":"https:\/\/x.com\/kevinktg88","icon":null},{"network":"Email","username":null,"url":"kevinktg@outlook.com","icon":null},{"network":"Phone","username":null,"url":"+61498 765 0619","icon":null}],"actions":[]},"about":{"summary":"An outcome-oriented Operations & Digital Transformation Manager with over 16 years of experience, specializing in enterprise service delivery, client relationship management, and business process transformation. Adept at building scalable systems and managing cross-functional teams, I drive efficiency through digital workflows, automation, and data-informed innovation. Currently leveraging expertise in AI, cybersecurity, and enterprise cloud technologies to deliver high-impact solutions for diverse clients, including SMEs and First Nation organizations."},"media":[],"work":[{"name":"Brewhub Australia Pty Ltd","position":"Digital Systems & Risk Oversight Manager","type":null,"url":"https:\/\/","start_date":"2022-11-01","end_date":"2024-12-31","summary":"Oversaw web platform governance and digital risk management, optimizing internal systems and championing cybersecurity protocols across client-facing services.","highlights":["Oversaw web platform governance, vendor lifecycle, and internal systems optimization, aligning with strategic operational goals.","Championed cybersecurity protocols and digital risk mitigation practices within enterprise workflows, enhancing data security.","Collaborated cross-departmentally to ensure secure, reliable digital operations across client-facing services."],"city":"Perth","state":null,"country":"Australia"},{"name":"Chevron Australia (contracted through Brewhub)","position":"Conference Services Manager","type":null,"url":"https:\/\/","start_date":"2023-11-01","end_date":"2024-05-28","summary":"Engineered and scaled national conference and catering operations, significantly boosting service delivery consistency and operational readiness.","highlights":["Engineered and scaled national conference and catering operations, boosting service delivery consistency across the organization.","Introduced resource and inventory tracking systems that reduced waste by 20% and increased staff efficiency.","Led the design and implementation of a self-service portal for internal clients, automating scheduling and reporting workflows.","Built and facilitated comprehensive training programs across multiple sites to ensure national operational readiness."],"city":"Perth","state":null,"country":"Australia"},{"name":"San Ling Chan Lawyers","position":"Legal Assistant (Contractor)","type":null,"url":"https:\/\/","start_date":"2016-01-01","end_date":"2024-05-28","summary":"Provided executive-level administrative and legal support, enhancing client communication and workflow efficiency through digitization initiatives.","highlights":["Provided executive-level administrative support, including client interview coordination and meticulous document drafting.","Contributed significantly to legal workflow digitization and systematization of client communications, improving operational efficiency."],"city":"Perth","state":null,"country":"Australia"},{"name":"Freelance Work","position":"Project & Digital Strategy Consultant","type":null,"url":"https:\/\/","start_date":"2008-01-01","end_date":"2024-05-28","summary":"Directed cross-industry projects, translating strategic goals into scalable implementation plans using low-code tools and integration platforms for diverse founders.","highlights":["Directed cross-industry projects involving branding, workflow automation, digital adoption, and client operations mapping.","Partnered with founders to translate strategic goals into scalable implementation plans using low-code tools and integration platforms."],"city":"Perth","state":null,"country":"Australia"},{"name":"Brewhub Australia Pty Ltd","position":"Client Services Manager","type":null,"url":"https:\/\/","start_date":"2023-08-01","end_date":"2023-11-30","summary":"Managed high-quality B2B service delivery for top-tier clients, optimizing daily operations and client issue resolution within tight deadlines.","highlights":["Served top-tier clients including Deloitte, KPMG, FMG, and Chevron, delivering high-quality B2B services.","Supervised and optimized daily service delivery across multiple service lines, ensuring consistent performance.","Developed performance tracking tools and feedback loops to resolve client issues within 24 hours.","Trained new hires and instituted Standard Operating Procedures (SOPs) to standardize experience delivery."],"city":"Perth","state":null,"country":"Australia"},{"name":"Chevron Australia (contracted through Brewhub)","position":"Conference Services Lead","type":null,"url":"https:\/\/","start_date":"2022-10-01","end_date":"2023-07-31","summary":"Led the establishment of a new department, developing robust KPI frameworks and ensuring seamless operational continuity during a major office relocation.","highlights":["Built a new department from scratch, encompassing hiring, onboarding, and comprehensive operational setup.","Developed robust KPI frameworks and continuous improvement programs, driving operational excellence.","Managed a large-scale office relocation, ensuring zero disruption to service continuity for critical operations."],"city":"Perth","state":null,"country":"Australia"},{"name":"PRS for Music","position":"Live Sound Engineer","type":null,"url":"https:\/\/www.prsformusic.com\/","start_date":"2019-04-01","end_date":"2020-06-30","summary":"Provided expert live sound engineering for internationally renowned artists, enhancing audience experience at major events, including Glastonbury Festival.","highlights":["Mixed live sound for internationally renowned artists, including at Glastonbury Festival, ensuring high-quality audio production.","Collaborated effectively with production teams to deliver seamless sound engineering at major events."],"city":"London","state":null,"country":"UK"}],"volunteer":[],"education":[{"institution":"Curtin University","url":"https:\/\/www.curtin.edu.au\/","area":"Bachelor of Commerce: Accounting & Finance","study_type":"FT","start_date":null,"end_date":null,"score":"Distinction","courses":[],"city":"Perth","state":null,"country":"Australia"},{"institution":"Western Australian Academy of Performing Arts","url":null,"area":"Bachelor of Performing Arts.: Music Business, & Sound Design.","study_type":"FT","start_date":null,"end_date":null,"score":"High Distinction","courses":[],"city":"Perth","state":null,"country":"Australia"}],"awards":[],"publications":[],"languages":[{"language":"English","fluency":null},{"language":"Chinese (Conversational)","fluency":null}],"certificates":[{"name":"Artificial Intelligence on Azure","date":"2025-05-26","issuer":"Microsoft","url":"https:\/\/www.coursera.org\/account\/accomplishments\/verify\/ERCZ8WQ7VNOP"},{"name":"Google AI Essentials","date":"2025-04-19","issuer":"Google","url":"https:\/\/www.coursera.org\/account\/accomplishments\/verify\/ISGWCAUMTWTC"},{"name":"Google AI Developer Program","date":"2025-03-31","issuer":"Google","url":"https:\/\/"},{"name":"Introduction to Generative AI Learning Path","date":"2025-03-09","issuer":"Google","url":"https:\/\/www.coursera.org\/account\/accomplishments\/specialization\/I1T2CVPKQSWK"},{"name":"Business Analytics & Process Automation","date":"2025-01-27","issuer":"Coursera","url":"https:\/\/www.coursera.org\/account\/accomplishments\/verify\/FLDIA5JN6B80"}],"skills":[{"name":"Soft Skills","keywords":["Leadership","Team Management","Event Planning","Business Process Optimization","Scalable Procedure Development","Service Workflow Automation","Operational Risk Reduction","Communication","Client Relations","Enterprise Stakeholder Engagement","Service Recovery","Feedback Loops","CRM","Performance Reporting","Strategic Planning","Stakeholder Management","Process Optimization","KPI Tracking"]},{"name":"Technical Skills","keywords":["Microsoft 365","Power BI","Power Automate","Copilot Studio","Notion","Trello","Asana","Monday.com","Zapier","Google Cloud Platform (GCP)","Microsoft Azure AI","Ollama","Docker Desktop","MCP Toolkit","Flowise","OpenMemory","Gemini Pro","ChatGPT Pro","Perplexity Labs","WSL2","Hugging Face","VS Code (Cline)","LocalSite.ai","Mem0","LangGraph","CrewAI","AutoGPT","Next.js","WordPress (Hostinger)","Canva","GSAP","JSONL","Unsloth","Custom CoD Chunking","Graphiti (Neo4j)","Kaggle"]},{"name":"AI\/ML & Data","keywords":["AI Solutions","AI Orchestration","Large Language Models (LLMs)","Qwen","DeepSeek","Gemma 3n","Gemini","Claude","ChatGPT","Ninja AI","Retrieval Augmented Generation (RAG)","Prompt Engineering","Fine-tuning (Unsloth)","Chain-of-Density (CoD) Chunking","AI Chatbot Development","Machine Learning Engineering","Data Sovereignty","OCAP Principles","CARE Principles","CBPR Frameworks"]},{"name":"Cybersecurity & Risk","keywords":["Cybersecurity Protocols","Digital Risk Mitigation","Enterprise Workflows","Data Privacy"]}],"interests":[],"references":[],"projects":[{"name":"AIOS Framework (AI-Orchestrated Solutions)","type":null,"description":"A modular, agent-ready framework designed to rapidly deploy AI-driven business solutions for Perth-based SMEs, focusing on local data privacy, low-cost open-source tooling, and cross-agent orchestration. Integrates intelligent workflows across chatbots, RAG pipelines, automation tools, and local LLMs for sustainable, owner-controlled AI deployment.","highlights":["Developed an Agentic Automation Engine leveraging local and cloud LLMs with shared memory (OpenMemory + MCP) to execute end-to-end workflows (chatbots, form processing, content creation).","Designed a flexible model architecture supporting local quantized models (Qwen, DeepSeek, Gemma 3n) and cloud-hosted agents (Gemini, Claude, ChatGPT, Ninja AI).","Implemented a multi-agent ready, plug-and-play structure with ports for CrewAI, LangGraph, Flowise, AutoGPT, and Notion\/GDocs automation tools.","Integrated Persona Routing and a Prompt Library for dynamic persona selection and context-aware prompt chaining.","Architected for Data Sovereignty Compliance, incorporating First Nation data governance protocols (OCAP, CARE) and supporting offline deployment with containerized training pipelines."],"start_date":"2023-01-01","end_date":"2024-05-28","url":"https:\/\/ktg.one","preview_image":null},{"name":"AI Chatbot for First Nation Catering Company","type":null,"description":"Led the design and training of a domain-specific AI chatbot for a First Nation catering company in Perth, utilizing lightweight open-source models with privacy-conscious fine-tuning and custom retrieval strategies.","highlights":["Led the design and training of a domain-specific AI chatbot for a First Nation catering company, reducing manual customer service workload by 50%.","Utilized lightweight open-source models (Gemma 3n) with privacy-conscious fine-tuning via Unsloth and custom Chain-of-Density (CoD) chunking strategy for optimized retrieval.","Delivered a culturally-aware assistant capable of processing over 300 menu items and company policies, with a scalable embedding architecture ready for RAG.","Created a repeatable chatbot template for other WA-based SMEs."],"start_date":"2023-01-01","end_date":"2024-05-28","url":"https:\/\/","preview_image":null},{"name":"AI Strategy Portfolio & Branding (KTG.one)","type":null,"description":"Built and launched KTG.one as a hybrid AI consultancy and personal portfolio hub, developing content pipelines and integrating agentic workflows for client acquisition.","highlights":["Built and launched KTG.one as a hybrid AI consultancy and personal portfolio hub, securing 3 inbound leads pre-launch.","Developed robust content pipelines for blog and YouTube launches, integrating agentic workflows using Gemini Pro.","Built SEO-optimized landing pages for multiple AI tools, including local models, automation services, and education initiatives."],"start_date":"2023-01-01","end_date":"2024-05-28","url":"https:\/\/ktg.one","preview_image":null},{"name":"First Nation AI Education Initiative","type":null,"description":"Co-researched and drafted a multi-tiered framework for an AI-powered, culturally-aligned educational tool designed for Indigenous children in remote Western Australia, emphasizing governance and privacy.","highlights":["Co-researched and drafted a multi-tiered framework for an AI-powered, culturally-aligned educational tool for Indigenous children in remote WA.","Mapped out governance structures, privacy-safe CV sensors, and offline-first deployment strategies with community co-design at the core.","Positioned the initiative for potential fellowship funding via Curtin University’s “Healthy Digital Child” initiative."],"start_date":"2023-01-01","end_date":"2024-05-28","url":"https:\/\/","preview_image":null},{"name":"Global AI Projects Portal","type":null,"description":"Strategic architecture and prompt library engineering for a global roadmap system powered by open-source AI agents, designed to tackle major planetary issues and facilitate collaborative research.","highlights":["Initiated the design of a global roadmap system powered by open-source AI agents to address major planetary issues (e.g., world hunger, education, emergency response).","Consolidated prompt knowledge and began building agent workflows using AutoGPT with Kaggle datasets for prototyping.","Actively collaborating with researchers (e.g., Dr. Mike Nzikou) on First Nation and remote learning applications."],"start_date":"2023-01-01","end_date":"2024-05-28","url":"https:\/\/","preview_image":null}],"links":[],"locations":[]}